/**
 * @file   	Lib_A_DI_debug_information.h
 * @author 	Isaev Mickle
 * @version	beta
 * @date 	10.04.2018
 * @brief	Библиотека содержит функции для формирования пакета данных, который
 * 			будет переведен программной SerialPlot в график
 */

#ifndef LIB_A_DI_DEBUG_INFORMATION_H
#define	LIB_A_DI_DEBUG_INFORMATION_H

/*#### |Begin| --> Секция - "Include" ########################################*/
/*==== |Begin| --> Секция - "C libraries" ====================================*/
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <string.h>
#include <stdarg.h>
/*==== |End  | <-- Секция - "C libraries" ====================================*/

/*==== |Begin| --> Секция - "MK peripheral libraries" ========================*/
/*==== |End  | <-- Секция - "MK peripheral libraries" ========================*/

/*==== |Begin| --> Секция - "Extern libraries" ===============================*/
#include "../Lib_A_CRC_cyclic_redundancy_check/Lib_A_CRC_cyclic_redundancy_check.h"
/*==== |End  | <-- Секция - "Extern libraries" ===============================*/
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Определение констант" ###########################*/
/*#### |End  | <-- Секция - "Определение констант" ###########################*/

/*#### |Begin| --> Секция - "Определение типов" ##############################*/
typedef struct {
	uint16_t frameStart;
    uint8_t frameSize;

    float dataArr[40];

    uint8_t crc;
} __attribute__((__packed__)) DI_data_for_serial_plot_s;
/*#### |End  | <-- Секция - "Определение типов" ##############################*/


/*#### |Begin| --> Секция - "Определение глобальных переменных" ##############*/
/*#### |End  | <-- Секция - "Определение глобальных переменных" ##############*/


/******************************************************************************/
//  Секция прототипов глобальных функций
extern uint16_t DI_CopyDataForSerialPlot_f32(
    DI_data_for_serial_plot_s *pStruct,
    float data,
    ...);
/*#### |End  | <-- Секция - "Прототипы глобальных функций" ###################*/


/******************************************************************************/
//  Секция определения макросов
/******************************************************************************/

/*#### |Begin| --> Секция - "Определение макросов" ###########################*/
/*#### |End  | <-- Секция - "Определение макросов" ###########################*/

#endif	/* %<%GUARD_NAME%>% */

/*############################################################################*/
/*################################ END OF FILE ###############################*/
/*############################################################################*/


////////////////////////////////////////////////////////////////////////////////