/**
 * @file   	Lib_A_DI_debug_information.h
 * @author 	Isaev Mickle
 * @version	beta
 * @date 	10.04.2018
 * @brief	Библиотека содержит функции для формирования пакета данных, который
 * 			будет переведен программной SerialPlot в график
 */

#ifndef LIB_A_DI_DEBUG_INFORMATION_H
#define	LIB_A_DI_DEBUG_INFORMATION_H

/*#### |Begin| --> Секция - "Include" ########################################*/
/*==== |Begin| --> Секция - "C libraries" ====================================*/
#include <stdint.h>
#include <string.h>
#include <stdarg.h>
/*==== |End  | <-- Секция - "C libraries" ====================================*/

/*==== |Begin| --> Секция - "MK peripheral libraries" ========================*/
/*==== |End  | <-- Секция - "MK peripheral libraries" ========================*/

/*==== |Begin| --> Секция - "Extern libraries" ===============================*/
#include "../Lib_A_CRC_cyclic_redundancy_check/Lib_A_CRC_cyclic_redundancy_check.h"
/*==== |End  | <-- Секция - "Extern libraries" ===============================*/
/*#### |End  | <-- Секция - "Include" ########################################*/

/*#### |Begin| --> Секция - "Определение констант" ###########################*/
#define DI_TERMINAL_SYMBOL	0xAAAAAAAA ///<		Значение терминального символа
/*#### |End  | <-- Секция - "Определение констант" ###########################*/

/*#### |Begin| --> Секция - "Определение типов" ##############################*/
typedef struct
{
	uint16_t frameStart;  ///< 	Символ старта пакета данных
	uint8_t frameSize;  ///< 	Количество полезных байтов

	float dataArr[40];  ///<	Данные, по которым SerialPlot построит графики

	uint8_t crc;  ///<			Конрольная сумма пакета данных;
}__attribute__((__packed__)) DI_data_for_serial_plot_s;
/*#### |End  | <-- Секция - "Определение типов" ##############################*/

/*#### |Begin| --> Секция - "Определение глобальных переменных" ##############*/
/*#### |End  | <-- Секция - "Определение глобальных переменных" ##############*/

/*#### |Begin| --> Секция - "Прототипы глобальных функций" ###################*/
extern uint16_t DI_CopyDataForSerialPlot_f32(
    DI_data_for_serial_plot_s *pStruct,
    float data,
    ...);
/*#### |End  | <-- Секция - "Прототипы глобальных функций" ###################*/

/*#### |Begin| --> Секция - "Определение макросов" ###########################*/
/*#### |End  | <-- Секция - "Определение макросов" ###########################*/

#endif	/* LIB_A_DI_DEBUG_INFORMATION_H */

/*############################################################################*/
/*################################ END OF FILE ###############################*/
/*############################################################################*/
